project/project-4-aggiestack/README_PartA.tex
% Created 2017-12-09 Sat 00:10
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Yinwei (Charlie) Zhang}
\date{\today}
\title{aggiestack: Part A}
\hypersetup{
 pdfauthor={Yinwei (Charlie) Zhang},
 pdftitle={aggiestack: Part A},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.3.1 (Org mode 9.1.1)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Time Spent}
\label{sec:orgb58fd12}
I spent abount 20 to 25 hours, according to my timer logs on Part A.  I had some trouble migrating my hardware state to include the rack information, and then updating all the unit tests to work with that.  That took around 5 hours.  I was done with the 'big' parts at about 14 hours in.

\subsection{What I learned}
\label{sec:org82cff0c}
Refactoring takes a long time!  I learned about keeping functions lightweight and composable.  For some functions, I kept them to be just DRY (don't repeat yourself), making it kind of brittle and not composable.  I'm viewing the functions as just transforming data.  I noticed that pure functions were easier to build upon; the refactored functions usually including file I/O.

Unit takes also rock, in the sense that it gives me confidence that the new code logically works.

\section{Github}
\label{sec:org83023cd}
The github commit with the code for part A can be found \href{https://github.tamu.edu/cyinwei/489-17-c/commit/19489697362ee15267be2bd3aa724673eb7a7a7e}{here}.  The commit after will include the readme (this file).
\section{Design}
\label{sec:org45749ab}
Very pure and data centric.  After parsing the \texttt{.txt} files, I store the data in JSON files.  Then server creates and deletes update the admin JSON file and the server JSON file.  There can be legit I/O errors with that (I would send queries to a SQL DB to try to get around that).  It's definitely not thread proof.

The CLI leverages click, a python package for writing CLIs.  It's very function driven, which I like.  The display, load, and parsing are all pure and reusable.  The writes aren't.
\section{Installation}
\label{sec:org230be07}
I moved to using \href{https://docs.pipenv.org/}{\texttt{Pipenv}} for this project, which is like a reproducible, better \texttt{pip}.  To install \texttt{pipenv}, just run `pip install pipenv` (straight from the home page).

Then in the project 4 (or zipped folder) directory, just run \texttt{pipenv install}, and it'll pick up the \texttt{Pipfile} and install my dependencies.  You'll notice that it'll install the editable (the \texttt{aggiestack} CLI), you now, afer you run \texttt{pipenv shell}, you can load the environment and run \texttt{aggiestack ...}!  

As a backup, you can default to the \texttt{aggiestack.py} to run aggiestack.  My dependencies are \texttt{click} and \texttt{python3}.

\section{Tests}
\label{sec:orgb3f7bab}
You can run my unit tests with \texttt{pytest} in the main folder (project4 or the unzipped folder).

\section{Output}
\label{sec:orgc3c92d1}
Here's what I have for the \texttt{stdout} from running \texttt{./input-sample-2.txt} on my machine.

\begin{verbatim}
Successfully configured hardware with [hdwr-config.txt].
Available default hardware configurations:
|name|cache size|
|----|----------|
|r1  |40960     |
|r2  |40960     |

|name  |rack|ip         |mem|disk|vcpu|
|------|----|-----------|---|----|----|
|m1    |r1  |128.0.0.1  |16 |8   |4   |
|m2    |r1  |128.0.0.2  |16 |32  |4   |
|m3    |r1  |128.0.0.3  |16 |16  |4   |
|m4    |r2  |128.0.0.4  |16 |8   |4   |
|k1    |r2  |128.1.1.0  |32 |32  |8   |
|k2    |r2  |128.1.0.2  |32 |32  |8   |
|k3    |r2  |128.1.3.0  |32 |32  |8   |
|calvin|r1  |128.129.4.4|8  |16  |1   |
|hobbes|r1  |1.1.1.1    |16 |64  |16  |
|dora  |r1  |1.1.1.2    |64 |256 |16  |
Successfully configured images with [image-config.txt].
Available base images configurations:
|name           |size|path                         |
|---------------|----|-----------------------------|
|linux-ubuntu   |128 |/images/linux-ubuntu-v1.0.img|
|linux-sles     |512 |/images/old-image.img        |
|linux-ubuntu-16|2048|/images/linux-ubuntu-16.img  |
Successfully configured flavors with [flavor-config.txt].
Available base flavor configurations:
|name  |mem|disk|vcpu|
|------|---|----|----|
|small |1  |1   |1   |
|medium|8  |2   |4   |
|large |16 |2   |4   |
|xlarge|32 |4   |8   |
Currently active virtual servers and their physical server locations (hardware).
NONE.
Successfully created virtual server [my-first-instance].
Successfully created virtual server [my-second-instance].
Currently active virtual servers and their physical server locations (hardware).
|name              |hardware|
|------------------|--------|
|my-first-instance |m1      |
|my-second-instance|m2      |
Currently active virtual servers:
|name              |image       |flavor|
|------------------|------------|------|
|my-first-instance |linux-ubuntu|small |
|my-second-instance|linux-ubuntu|medium|
Available current (admin) hardware configurations:
Racks:
|name|cache size|
|----|----------|
|r1  |40960     |
|r2  |40960     |

Servers:
|name  |rack|ip         |mem|disk|vcpu|
|------|----|-----------|---|----|----|
|m1    |r1  |128.0.0.1  |15 |7   |3   |
|m2    |r1  |128.0.0.2  |8  |30  |0   |
|m3    |r1  |128.0.0.3  |16 |16  |4   |
|m4    |r2  |128.0.0.4  |16 |8   |4   |
|k1    |r2  |128.1.1.0  |32 |32  |8   |
|k2    |r2  |128.1.0.2  |32 |32  |8   |
|k3    |r2  |128.1.3.0  |32 |32  |8   |
|calvin|r1  |128.129.4.4|8  |16  |1   |
|hobbes|r1  |1.1.1.1    |16 |64  |16  |
|dora  |r1  |1.1.1.2    |64 |256 |16  |
Removed server [my-first-instance].
Currently active virtual servers and their physical server locations (hardware).
|name              |hardware|
|------------------|--------|
|my-second-instance|m2      |
Available current (admin) hardware configurations:
Racks:
|name|cache size|
|----|----------|
|r1  |40960     |
|r2  |40960     |

Servers:
|name  |rack|ip         |mem|disk|vcpu|
|------|----|-----------|---|----|----|
|m1    |r1  |128.0.0.1  |16 |8   |4   |
|m2    |r1  |128.0.0.2  |8  |30  |0   |
|m3    |r1  |128.0.0.3  |16 |16  |4   |
|m4    |r2  |128.0.0.4  |16 |8   |4   |
|k1    |r2  |128.1.1.0  |32 |32  |8   |
|k2    |r2  |128.1.0.2  |32 |32  |8   |
|k3    |r2  |128.1.3.0  |32 |32  |8   |
|calvin|r1  |128.129.4.4|8  |16  |1   |
|hobbes|r1  |1.1.1.1    |16 |64  |16  |
|dora  |r1  |1.1.1.2    |64 |256 |16  |
\end{verbatim}

\section{Sources}
\label{sec:org243a4ea}
I used a lot more Stackoverflow this time, but the sources remain the same.

\begin{itemize}
\item The \href{http://click.pocoo.org/5/}{click documentation} helped a ton.  Click is a command line interface builder in python.  This intro \href{https://kushaldas.in/posts/building-command-line-tools-in-python-with-click.html}{blog post} convinced me to use it.
\item The Python3 documentation, specifically on \texttt{pathlib} and on file handling.
\item Vscode python, specifically using \texttt{flake8}, which is way less restrictive than \texttt{pylint}.
\item Stackoverflow for answers from Google.
\end{itemize}
\end{document}
